Repository: obiwan007/despresso
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, ko

# screenSettingsSaveShotGraphDataEvenForPrePouringStates
source: Include heating phase in saved shot graph data
ar: حفظ بيانات الرسم البياني بالرصاص حتى لحالات الصب المسبق
de: Speichere Shot Daten auch vor der eigentliche Pouring Phase
es: Guarde los datos del gráfico de tiro incluso para los estados previos al vertido
ko: 사전 주입 상태에 대한 샷 그래프 데이터 저장

# screenSettingsScalesFound
source: Scales
ar: مقاييس
de: Waagen
es: Escamas
ko: 저울

# screenSettingsScaleSupport
source: Scale support
ar: دعم الميزان
de: Waagen Unterstützung
es: Soporte de escala
ko: 저울 지원

# screenSettingsScreenAndBrightness
source: Screen and Brightness
ar: الشاشة والسطوع
de: Bildschirm und Helligkeit
es: Pantalla y Brillo
ko: 화면 및 밝기

# screenSettingsSecondFlushTimerS
source: Second Flush timer [s]
ar: مؤقت التدفق الثاني
de: Zweiter Spülen Timer [s]
es: Temporizador de segunda descarga [s]
ko: 두 번째 플러시 타이머 [s]

# screenSettingsSelectFiles
source: Select files
ar: اختر الملفات
de: Dateiauswahl
es: Selecciona archivos
ko: 파일 선택

# screenSettingsSendDe1ShotUpdates
source: Send de1 shot updates
ar: إرسال تحديثات لقطة de1
de: Senden von de1 shot Updates
es: Enviar actualizaciones de 1 toma
ko: de1 샷 업데이트 보내기

# screenSettingsSendDe1StateUpdates
source: Send de1 state updates
ar: إرسال تحديثات حالة de1
de: Senden von de1 Status Updates
es: Enviar actualizaciones de estado de1
ko: de1 상태 업데이트 보내기

# screenSettingsSendDe1WaterLevelUpdates
source: Send de1 water level updates
ar: إرسال تحديثات مستوى المياه de1
de: Senden des de1 Wasser Levels
es: Enviar actualizaciones de nivel de agua de1
ko: de1 수위 업데이트 보내기

# screenSettingsSendInformationsToSentryioIfTheAppCrashesOrYou
source: Send informations to sentry.io if the app crashes or you use the feedback option. Check https://sentry.io/privacy/ for detailed data privacy description.
ar: أرسل المعلومات إلى sentry.io في حالة تعطل التطبيق أو استخدام خيار التعليقات. تحقق من https://sentry.io/privacy/ للحصول على وصف تفصيلي لخصوصية البيانات.
de: Sende Infos zu sentry.io im Falle das die App abstürzt oder die Feedback Funktion benutzt wird. Siehe https://sentry.io/privacy/ für eine genaue Beschreibung der geltenen Privatsphären Einstellungen von Sentry.io.
es: Envíe información a sentry.io si la aplicación falla o si usa la opción de comentarios. Consulte https://sentry.io/privacy/ para obtener una descripción detallada de la privacidad de datos.
ko: 앱이 충돌하거나 피드백 옵션을 사용하는 경우 sentry.io에 정보를 보냅니다. 자세한 개인 정보 보호 설명은 https://sentry.io/privacy/를 확인하세요.

# screenSettingsSendingTheStatusOfTheDe1
source: Sending the status of the de1
ar: إرسال حالة de1
de: Senden des Status der de1
es: Envío del estado del de1
ko: de1의 상태 보내기

# screenSettingsSendTabletBatteryLevelUpdates
source: Send tablet battery level updates
ar: إرسال تحديثات مستوى بطارية الجهاز اللوحي
de: Senden von Tablet Batterie Updates
es: Enviar actualizaciones del nivel de batería de la tableta
ko: 태블릿 배터리 량 업데이트 보내기

# screenSettingsSettingsAreRestoredPleaseCloseAppAndRestart
source: Settings are restored. Please close app and restart.
ar: تمت استعادة الإعدادات. الرجاء إغلاق التطبيق وإعادة التشغيل.
de: Einstellungen wurden wiederhergestellt. Bitte die App komplett beenden und neu Starten (Task Manager).
es: Se restauran los ajustes. Cierra la aplicación y reinicia.
ko: 설정이 복원됩니다. 앱을 닫고 다시 시작해 주세요.

# screenSettingsShotSettings
source: Shot Settings
ar: إعدادات اللقطة
de: Shot Einstellungen
es: Ajustes de tiro
ko: 샷 설정

# screenSettingsShowClockDuringScreensaver
source: Show clock during screensaver
ar: عرض الساعة أثناء شاشة التوقف
de: Uhr auf dem Bildschirmschoner anzeigen
es: Mostrar reloj durante el salvapantallas
ko: 화면 보호기 동안 시계 표시

# screenSettingsShowFlush
source: Show Flush
ar: عرض Flush
de: Spülen Anzeigen
es: Mostrar al ras
ko: 플러시 표시

# screenSettingsSmartCharging
source: Smart charging
ar: الشحن الذكي
es: Carga inteligente
ko: 스마트 충전

# screenSettingsSpanish
source: Spanish
ar: الأسبانية
de: Spanisch
es: Español
ko: 스페인어

# screenSettingsSpecialBluetoothDevices
source: Special Bluetooth devices
ar: أجهزة البلوتوث الخاصة
de: Spezielle Bluetooth Geräte
es: Dispositivos Bluetooth especiales
ko: 특수 블루투스 장치

# screenSettingsStopBeforeWeightWasReachedS
source: Stop before weight was reached [s]
ar: التوقف قبل الوصول للوزن
de: Anhalten bevor das Zielgewicht erreicht wurde [s]
es: Deténgase antes de alcanzar el peso [s]
ko: 무게에 도달하기 전에 정지[s]

# screenSettingsStopOnWeightIfScaleDetected
source: Stop on Weight if scale detected
ar: التوقف على الوزن عند توصيل الميزان
de: Bei erreichtem Gewicht stoppen wenn Waage verbunden ist
es: Detener en peso si se detecta una báscula
ko: 저울이 감지되면 무게에서 중지

# screenSettingsSwitchDe1ToSleepModeIfItIsIdleFor
source: Switch de1 to sleep mode if it is idle for some time [min]
ar: بدّل de1 إلى وضع السكون إذا كان خاملاً لبعض الوقت [دقيقة]
de: Wenn im Idle Modus die de1 nach Zeit in den Standby schicken [min]
es: Cambie de1 al modo de suspensión si está inactivo durante algún tiempo [min]
ko: 일정 시간 동안 유휴 상태인 경우 de1을 절전 모드로 전환[분]

# screenSettingsSwitchOffSteamHeating
source: Switch off steam heating
ar: أوقف تشغيل التدفئة بالبخار
de: Dampfheizung ausschalten
es: Apague la calefacción de vapor
ko: 스팀 가열 끄기

# screenSettingsSwitchOnScreensaverIfDe1ManuallySwitchedToSleep
source: Switch on screensaver if de1 manually switched to sleep
ar: قم بتشغيل شاشة التوقف إذا تحول de1 يدويًا إلى وضع السكون
de: Wenn die de1 per App in den Standby geschaltet wird, automatisch Bildschirmschoner aktivieren
es: Encienda el protector de pantalla si de1 cambió manualmente a suspensión
ko: de1이 수동으로 절전 모드로 전환된 경우 화면 보호기 켜기

# screenSettingsTabletDefault
source: Tablet default
ar: الجهاز اللوحي الافتراضي
es: Valor predeterminado de la tableta
ko: 태블릿 기본값

# screenSettingsTabletGroup
source: Tablet
ar: جهاز التابلت
es: Tableta
ko: 태블릿

# screenSettingsTare
source: Tare
ar: الفارغة
de: Tara
es: Tara
ko: 살갈퀴

# screenSettingsTesting
source: Testing
ar: اختبارات
de: Testen
es: Pruebas
ko: 테스트

# screenSettingsTestingScales
source: Testing features of scales
ar: ميزات اختبار المقاييس
de: Testfunktionen für Waagen
es: Características de prueba de escalas.
ko: 저울의 테스트 기능

# screenSettingsThemeSelection
source: Language and Theme selection
ar: اختيار اللغة والموضوع
de: Spracheinstellungen und Theme Auswahl
es: Selección de idioma y tema
ko: 언어 및 테마 선택

# screenSettingsThisCanLeadToAHigherLoadOnYourMqtt
source: This can lead to a higher load on your MQTT server as the message frequency is about 10Hz.
ar: يمكن أن يؤدي هذا إلى تحميل أعلى على خادم MQTT الخاص بك حيث أن تردد الرسالة يبلغ حوالي 10 هرتز.
de: Das könnte zu einer höheren Last im MQTT Server führen. Die Updatefrequenz ist etwa 10Hz.
es: Esto puede generar una mayor carga en su servidor MQTT ya que la frecuencia de los mensajes es de aproximadamente 10 Hz.
ko: 메시지 빈도가 약 10Hz이므로 MQTT 서버에 더 높은 부하가 발생할 수 있습니다.

# screenSettingsToSaveEnergyTheSteamHeaterWillBeTurnedOff
source: To save energy the steam heater will be turned off and the steam tab will be hidden.
ar: لتوفير الطاقة ، سيتم إيقاف تشغيل سخان البخار وإخفاء علامة تبويب البخار.
de: Um Energie zu sparen, kann der Dampferhitzer ausgeschaltet werden und das 'Dampf' tab wird nicht angezeigt.
es: Para ahorrar energía, el calentador de vapor se apagará y la pestaña de vapor se ocultará.
ko: 에너지를 절약하기 위해 스팀 히터가 꺼지고 스팀 탭이 숨겨집니다.

# screenSettingsUploadShotsToVisualizer
source: Upload Shots to Visualizer
ar: تحميل اللقطات إلى متخيل
de: Upload Shots zu Visualizer.coffee
es: Subir tomas al visualizador
ko: Visualizer에 샷 업로드

# screenSettingsUserNameCantBeSmallerThan4Letters
source: User Name can't be smaller than 4 letters
ar: لا يمكن أن يكون اسم المستخدم أصغر من 4 أحرف
de: User Name muss mindestens 4 Zeichen haben
es: El nombre de usuario no puede tener menos de 4 letras
ko: 사용자 이름은 4자보다 작을 수 없습니다.

# screenSettingsUserNameemail
source: User Name/email
ar: اسم المستخدم / البريد الإلكتروني
es: Nombre de usuario/correo electrónico
ko: 사용자 이름/이메일

# screenSettingsWakeUpDe1IfAppIsLaunched
source: Wake up de1 if app is launched
ar: استيقظ de1 إذا تم تشغيل التطبيق
de: Wenn die App gestartet wird, de1 automatisch aufwecken
es: Activar de1 si se inicia la aplicación
ko: 앱이 실행되면 깨우기 de1

# screenSettingsWakeUpDe1IfScreenTappedIfScreenWasOff
source: Wake up de1 if screen tapped (if screen was off)
ar: استيقظ de1 إذا تم النقر على الشاشة (إذا كانت الشاشة مغلقة)
de: Wenn Bildschirmschoner deaktiviert wird, de1 aus dem Standby aufwecken
es: Activar de1 si se toca la pantalla (si la pantalla estaba apagada)
ko: 화면을 탭하면 de1 깨우기(화면이 꺼져 있는 경우)

# screenSettingsWeightedContainer
source: Weighted container
ar: حاوية مرجحة
de: Gewogene Behälter
es: Contenedor ponderado
ko: 가중 컨테이너

# screenSettingsWeightOfOneContainers
source: Weight of containers
ar: وزن الحاويات
de: Gewicht der Behälter
es: Peso de los contenedores
ko: 용기의 무게

# screenSettingsYouChangedCriticalSettingsYouNeedToRestartTheApp
source: You changed critical settings. You need to restart the app to make the settings active.
ar: لقد قمت بتغيير الإعدادات الحرجة. تحتاج إلى إعادة تشغيل التطبيق لتنشيط الإعدادات.
de: Es wurden kritische Einstellungen geändert. Es wird ein Neustart der App benötigt.
es: Cambió la configuración crítica. Debe reiniciar la aplicación para activar la configuración.
ko: 중요한 설정을 변경했습니다. 설정을 활성화하려면 앱을 다시 시작해야 합니다.

# screenShotEditBarrista
source: Barrista
ar: باريستا
ko: 바리스타

# screenShotEditDescribeYourExperience
source: Describe your experience
ar: صِف تجربتك
de: Beschreibung
es: Describe tu experiencia
ko: 느낌을 설명하세요

# screenShotEditDoseWeightG
source: Dose weight [g]
ar: وزن الجرعة [جم]
de: Einwaage [g]
es: Dosis peso [g]
ko: 도징량 [g]

# screenShotEditDrinker
source: Drinker
ar: شارب
es: Bebedor
ko: 마시는 사람

# screenShotEditDrinkWeightG
source: Drink weight [g]
ar: وزن الشراب [g]
de: Zielgewicht [g]
es: Peso de la bebida [g]
ko: 음료 무게 [g]

# screenShotEditEnjoyment
source: Enjoyment
ar: التمتع
es: Disfrute
ko: 향유

# screenShotEditExtractionYield
source: Extraction yield
ar: عائد الاستخراج
de: Extraktions Ausbeute
es: Rendimiento de extracción
ko: 추출 수율

# screenShotEditGrinder
source: Grinder
ar: طاحونة
de: Mühle
es: Amoladora
ko: 그라인더

# screenShotEditGrinderSettings
source: Grinder settings
ar: إعدادات المطحنة
de: Mühleneinstellungen
es: Configuración del molinillo
ko: 그라인더 설정

# screenShotEditOpenInVisualizercoffee
source: Open in Visualizer.coffee
ar: افتح في Visualizer.coffee
de: In Visualizer.coffee öffnen
es: Abrir en Visualizer.coffee
ko: Visualizer.coffee에서 열기

# screenShotEditPouringTimeS
source: Pouring time [s]
ar: وقت الصب
de: Zubereitungszeit [s]
es: Tiempo de vertido [s]
ko: 푸어링 시간 [s]

# screenShotEditPouringWeightG
source: Pouring weight [g]
ar: وزن الصب [g]
de: Gewicht Getränk [g]
es: Peso de colada [g]
ko: 푸어링 무게 [g]

# screenShotEditSuccessUploadingYourShot
source: Success uploading your shot
ar: تم تحميل اللقطة بنجاح
es: Éxito al subir tu foto
ko: 샷 업로드 성공

# screenShotEditTitle
source: Describe your experience with shot from {desc}
ar: صِف تجربتك مع لقطة من {desc}
de: Beschreibung des Shots vom {desc}
es: Describa su experiencia con la toma de {desc}
ko: {desc}에서 샷의 느낌을 설명하세요

# screenShotEditTotalDissolvedSolidssTds
source: Total Dissolved Solidss (TDS)
ar: إجمالي المواد الصلبة الذائبة (TDS)
es: Sólidos Disueltos Totales (TDS)
ko: 총 용존성 고형물질(TDS)

# screenShowGraphDataBeforePouringPhaseStarts
source: Show graph data before pouring phase starts.
ar: عرض بيانات الرسم البياني قبل بدء مرحلة الصب.
de: Zeige Diagramm Daten bevor die Pouring Phase anfängt.
es: Muestra los datos del gráfico antes de que comience la fase de vertido.
ko: 주입 단계가 시작되기 전에 그래프 데이터를 표시합니다.

# screenSteamAmbient
source: Ambient
ar: الجو المحيط
de: Umgebung
es: Ambiente
ko: 주변

# screenSteamFlowrate
source: Steam Flowrate {flow} ml/s
ar: معدل تدفق البخار {flow} مل/ثانية
de: Dampf Flussgeschwindigkeit {flow} ml/s
es: Caudal de vapor {flow} ml/s
ko: 증기 유량 {flow} ml/s

# screenSteamOffNormalPurgeAfterStop
source: Off (normal purge after stop)
ar: متوقف (التنظيف العادي بعد التوقف)
de: Aus (normaler purge nach Stop)
es: Apagado (purga normal después de la parada)
ko: 꺼짐(정지 후 일반 퍼지)

# screenSteamOnSlowPurgeOn1stStop
source: On (slow purge on 1st stop)
ar: قيد التشغيل (التنظيف البطيء عند التوقف الأول)
de: An (langsamer purge nach erstem Stop)
es: Encendido (purga lenta en la primera parada)
ko: 켜짐(첫 번째 정지 시 느린 퍼지)

# screenSteamReset
source: Reset
ar: إعادة الضبط
es: Reiniciar
ko: 초기화

# screenSteamStopAtTemperatur
source: Stop at Temperature {temp} °C
ar: توقف عند درجة حرارة {temp}
de: Stop bei Temperatur {temp} °C
es: Detener a la temperatura {temp} °C
ko: 온도 {temp} °C에서 정지

# screenSteamTemperaturs
source: Steam Temperature {temp} °C
ar: درجة حرارة البخار {temp}
de: Dampf Temperatur {temp} °C
es: Temperaturas de vapor {temp} °C
ko: 증기 온도 {temp} °C

# screenSteamTempTip
source: Temp Tip
ar: إرشادات درجة الحرارة
es: Punta de temperatura
ko: 온도 팁

# screenSteamTimerS
source: Timer {t} s
ar: الموقت {t}
es: Temporizador {t} s
ko: 타이머 {t}초

# screenSteamTimeS
source: Time/s
ar: الوقت / ثانية
de: Zeit/s
es: Veces
ko: 시간/s

# screenSteamTwotapMode
source: Steam two-tap mode:
ar: وضع البخار بنقرتين
de: Dampf two-tap mode:
es: Modo Steam de dos toques:
ko: Steam 투탭 모드:

# screenWaterTemp
source: Water Temperature
ar: درجة حرارة الماء
de: Wassertemperatur
es: Temperatura de agua
ko: 수온

# screenWaterTemperatureWatertemp
source: Water Temperature {watertemp} °C
ar: درجة حرارة الماء {watertemp}
de: Wassertemperatur {watertemp} °C
es: Temperatura del agua {watertemp} °C
ko: 수온 {watertemp}°C

# screenWaterWeightG
source: Weight {w} g
ar: الوزن {w} جرام
de: Gewicht {w} g
es: Peso {w} g
ko: 무게 {w}g

# screenWaterWeightVolume
source: Water Weight/Volume {volume} g or ml
ar: وزن / حجم الماء {volume} جم أو مل
de: Wassergewicht/Volumen {volume} g oder ml
es: Agua Peso/Volumen {volumen} g o ml
ko: 물 무게/부피 {volume} g 또는 ml

source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
ko: 설정

# settingsAutostartTimerOnScaleDuringPuring
source: Autostart timer on scale during puring
ar: مؤقت التشغيل التلقائي على نطاق واسع أثناء عملية التطهير
de: Autostart-Timer auf der Waage während des Kaffeebrauens
es: Temporizador de inicio automático en la báscula durante el purgado
ko: 퓨링 중 규모에 따른 자동 시작 타이머

# settingsContainerAutotare
source: Tare if weight was detected
ar: الفارغة إذا تم الكشف عن الوزن
de: Tara, wenn Gewicht erkannt wurde
es: Tara si se detectó peso
ko: 무게가 감지되면 테어링

# settingsContainerCurrentWeight
source: Current Weight
ar: الوزن الحالي
de: Aktuelles Gewicht
es: Peso actual
ko: 현재 무게

# settingsMoveonatweightThresholdS
source: Move-on-at-weight threshold [s]
ar: عتبة الحركة على الوزن [s]
de: Weitergehen bei Gewichtsschwelle [s]
es: Umbral de avance con peso [s]
ko: 무게에 따른 이동 임계값 [s]

# settingsNextStepWillBeTriggeredAtThisDurationFromReaching
source: Next step will be triggered at this duration from reaching target weight
ar: سيتم تشغيل الخطوة التالية في هذه المدة من الوصول إلى الوزن المستهدف
de: Der nächste Schritt wird in dieser Zeit nach Erreichen des Zielgewichts ausgelöst
es: El siguiente paso se activará en este momento después de alcanzar el peso objetivo.
ko: 목표 체중에 도달한 후 이 기간 동안 다음 단계가 시작됩니다.

# settingsRefillWatertankAtLimit
source: Refill watertank at limit
ar: أعد ملء خزان المياه عند الحد الأقصى
de: Wassertank Füllstands-Limit
es: Rellenar tanque de agua al límite
ko: 한계에 도달하면 물탱크를 다시 채우세요.

# settingsSleepAllowTabletSleepDuringScreensaver
source: Allow tablet sleep during screensaver
ar: السماح للكمبيوتر اللوحي بوضع السكون أثناء شاشة التوقف
de: Lassen Sie den Tablet-Ruhezustand während des Bildschirmschoners zu
es: Permitir que la tableta duerma durante el protector de pantalla
ko: 화면 보호기 중에 태블릿 절전 허용

# settingsSleepAllowTabletSleepWhenMachineIsSleepingOrDisconnected
source: Allow tablet sleep when machine is sleeping or disconnected
ar: اسمح للكمبيوتر اللوحي بالنوم عندما يكون الجهاز في وضع السكون أو غير متصل
de: Ermöglichen Sie den Ruhezustand des Tablets, wenn sich die de1 im Ruhezustand befindet oder nicht angeschlossen ist
es: Permitir que la tableta esté inactiva cuando la máquina está inactiva o desconectada
ko: 컴퓨터가 절전 모드이거나 연결이 끊긴 경우 태블릿 절전 허용

# settingsSleepMinutesToSpendInScreensaverBeforeAllowingSleep
source: Minutes to spend in screensaver before allowing sleep
ar: دقائق تقضيها في شاشة التوقف قبل السماح بالنوم
de: Minuten, die Sie im Bildschirmschoner verbringen können, bevor das Tablet in den Ruhemodus wechselt
es: Minutos para pasar en salvapantallas antes de permitir dormir
ko: 절전 모드를 허용하기 전에 화면 보호기에서 소요되는 시간(분)

# settingsSleepWarning
source: Warning: depending on your tablet and operating system settings, letting your tablet go to sleep might cause interruptions to the Bluetooth connection to your machine or accessories.
ar: تحذير: وفقًا لإعدادات جهازك اللوحي ونظام التشغيل، قد يؤدي السماح لجهازك اللوحي بالدخول إلى وضع السكون إلى انقطاع اتصال Bluetooth بجهازك أو ملحقاته.
de: Warnung: Abhängig von den Einstellungen Ihres Tablets und Ihres Betriebssystems kann es zu Unterbrechungen der Bluetooth-Verbindung zu Ihrem Gerät oder Zubehör kommen, wenn Sie Ihr Tablet in den Ruhezustand versetzen.
es: Advertencia: dependiendo de la configuración de su tableta y del sistema operativo, dejar que su tableta entre en modo de suspensión puede causar interrupciones en la conexión Bluetooth a su máquina o a sus accesorios.
ko: 경고: 태블릿 및 운영 체제 설정에 따라 태블릿을 절전 모드로 전환하면 기기 또는 액세서리에 대한 Bluetooth 연결이 중단될 수 있습니다.

# settingsSleepWhenMachineIsInSleepSwitchOffScaleDisplayIf
source: When machine is in sleep, switch off scale display if possible
ar: عندما يكون الجهاز في وضع السكون، قم بإيقاف تشغيل عرض المقياس إن أمكن
de: Wenn sich die Maschine im Ruhezustand befindet, wird die Waagenanzeige nach Möglichkeit ausgeschaltet.
es: Cuando la máquina esté en reposo, apague la visualización de la báscula si es posible.
ko: 기계가 절전 모드일 때 가능하면 스케일 표시를 끄십시오.

# settingsTabletSleep
source: Tablet sleep
ar: النوم اللوحي
de: Tablet-Schlaf
es: Dormir en tableta
ko: 태블릿 수면

# settingsTareifTheScaleIsAlreadyConnectedTareIsCalledIf
source: If the scale is already connected, tare is called if machine woke up from sleep.
ar: إذا كان الميزان متصلاً بالفعل، فسيتم استدعاء الفارغة إذا استيقظت الآلة من النوم.
de: Wenn die Waage bereits angeschlossen ist, wird Tara aufgerufen, wenn die Maschine aus dem Ruhezustand erwacht.
es: Si la báscula ya está conectada, se solicita la tara si la máquina se despierta del modo de suspensión.
ko: 저울이 이미 연결되어 있는 경우, 기기가 절전 모드에서 깨어나면 용기 측정이 호출됩니다.

# settingsTareOnWakeupOfDe1
source: Tare on wakeup of de1
ar: الفارغة على الاستيقاظ من de1
de: Tarieren Sie beim Aufwachen von de1
es: Tara al despertar de de1
ko: de1의 웨이크업 시 테어

# settingsWeightcontainer1IeWeightCup
source: Container 1 (i.E. weight cup):
ar: الحاوية 1 (أي كوب الوزن):
de: Behälter 1 (d. h. Gewichtsbecher):
es: Contenedor 1 (es decir, taza de peso):
ko: 용기 1(예: 웨이트 컵):

# settingsWeightcontainer2IeEspressoCup
source: Container 2 (i.E. Espresso Cup):
ar: الحاوية 2 (أي كوب الإسبريسو):
de: Behälter 2 (d. h. Espressotasse):
es: Contenedor 2 (es decir, taza de café expreso):
ko: 용기 2(예: 에스프레소 컵):

# settingsWeightcontainer3IeSteamMug
source: Container 3 (i.E. Steam Mug):
ar: الحاوية 3 (أي كوب البخار):
de: Behälter 3 (z. B. Dampfbecher):
es: Contenedor 3 (es decir, taza de vapor):
ko: 용기 3(예: 스팀 머그):

# settingsWeightcontainer4IeSteamMug
source: Container 4 (i.E. Steam Mug):
ar: الحاوية 4 (أي كوب البخار):
de: Behälter 4 (z. B. Dampfbecher):
es: Contenedor 4 (es decir, taza de vapor):
ko: 용기 4(예: 스팀 머그):

source: Show
ar: عرض
de: Anzeigen
es: Espectáculo
ko: 보여주다

source: Start
ar: ابدأ
es: Comenzar
ko: 시작

# stateDisconnected
source: disconnected
ar: انقطع الاتصال
de: GETRENNT
es: desconectado
ko: 연결이 끊긴

# state_Disconnected
source: disconnected
ar: انقطع الاتصال
de: getrennt
es: desconectado
ko: 연결이 끊긴

# stateIdleHeated
source: heated up
ar: تسخين
de: aufgeheizt
es: calentado
ko: 가열 중

# statePour
source: pour
ar: صبّ
de: Bezug
es: verter
ko: 붓다

# steamScreenTempC
source: Temp [°C]
ar: درجة الحرارة [درجة مئوية]
es: temperatura [°C]
ko: 온도 [°C]

source: Stop
ar: قف
es: Detener
ko: 중지

# subStateHeatWaterHeater
source: Heating Water
ar: تسخين المياه
de: Heize Wasser
es: Calentando agua
ko: 가열 중

# subStateHeatWaterTank
source: Heating Tank
ar: خزان الحرارة
de: Heize Tank
es: Tanque de calefacción
ko: 가열 중

source: Switch on
ar: مفتاح التشغيل
de: Einschalten
es: Encender
ko: 시작

# tabHomeEspresso
source: Espresso
ar: إسبرسو
es: Café exprés
ko: 에스프레소

# tabHomeFlush
source: Flush
ar: تنظيف
de: Spülen
es: Enjuagar
ko: 플러시

# tabHomeRecipe
source: Recipe
ar: وصفة
de: Rezept
es: Receta
ko: 레시피

# tabHomeSteam
source: Steam
ar: تبخير
de: Dampf
es: Vapor
ko: 증기

# tabHomeWater
source: Water
ar: ماء
de: Wasser
es: Agua
ko: 물

source: Temp
ar: درجة الحرارة
es: Temperatura
ko: 온도

# validatorNotBeEmpty
source: must not be empty
ar: يجب ألا يكون فارغًا
es: no debe estar vacío
ko: 비어 있으면 안 됩니다.

source: Wait
ar: انتظر
de: Warten
es: Esperar
ko: 준비

source: Weight
ar: الوزن
de: Gewicht
es: Peso
ko: 무게
