Repository: obiwan007/despresso
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, ko

source: Beans
ar: حبوب البُن
de: Bohnen
es: Frijoles
ko: 원두

source: Blue
ar: أزرق
de: Blau
es: Azul
ko: 파란색

source: Disabled
ar: تعطيل
de: Deaktiviert
es: Desactivado
ko: 사용 안함

source: disconnected
ar: انقطع الاتصال
es: desconectado
ko: 연결이 끊긴

source: EDIT
ar: تحرير
de: Ändern
es: EDITAR
ko: 편집하다

source: Enabled
ar: تمكين
de: Aktiviert
es: Activado
ko: 사용

source: error
ar: خطأ
de: Fehler
ko: 오류

source: Exit
ar: خروج
es: Salida
ko: 종료

source: Flow
ar: التدفق
de: Fluss
es: Fluir
ko: 흐름

# footerBattery
source: Battery
ar: بطارية
de: Batterie
es: Batería
ko: 배터리

# footerConnect
source: Connect
ar: يتصل
de: Verbinden
es: Conectar
ko: 연결하다

# footerGroup
source: Group
ar: مجموعة
es: Grupo
ko: 그룹

# footerProbe
source: Probe
ar: مسبار
es: Investigacion
ko: 조사

# footerRefillWater
source: Refill water
ar: إعادة ملء المياه
de: Wasser auffüllen
es: recargar agua
ko: 리필 물

# footerScale
source: Scale
ar: حجم
de: Waage
es: Escala
ko: 저울

# footerTare
source: Tare
ar: الفارغة
de: Tara
es: Tara
ko: 영점

# footerWater
source: Water
ar: ماء
de: Wasser
es: Agua
ko: 물

# graphFlowMlsPressureBar
source: Flow [ml/s] / Pressure [bar]
ar: التدفق [ml / s] / الضغط [bar]
de: Fluss [ml/s] / Druck [bar]
es: Caudal [ml/s] / Presión [bar]
ko: 유량[ml/s] / 압력[bar]

# graphTime
source: Time/s
ar: الوقت / ثانية
de: Zeit/s
es: Veces
ko: 시간/s

source: Green
ar: أخضر
de: Grün
es: Verde
ko: 녹색

source: Hide
ar: إخفاء
de: Verstecken
es: Esconder
ko: 숨기다

# mainMenuDespressoFeedback
source: Despresso Feedback
ar: ملاحظات ديسبريسو
es: Comentarios de café
ko: 에스프레소 피드백

# mainMenuEspressoDiary
source: Espresso Diary
ar: سجل الاسبريسو
de: Espresso Logbuch
es: Diario de espresso
ko: 에스프레소 다이어리

# mainMenuFeedback
source: Feedback
ar: تعليق
es: Comentario
ko: 피드백

# mainMenuMaintenance
source: Maintenance
ar: صيانة
de: Wartung
es: Mantenimiento
ko: 유지

# mainMenuStatistics
source: Statistics
ar: إحصائيات
de: Statistiken
es: Estadísticas
ko: 통계

source: No
ar: لا
de: Nein
ko: 아니요

source: Off
ar: إغلاق
de: Aus
es: Apagado
ko: 꺼짐

source: Ok
ar: نعم
es: De acuerdo
ko: 좋아요

source: On
ar: تشغيل
de: Ein
es: En
ko: 켜짐

source: Orange
ar: برتقالي
es: Naranja
ko: 주황색

source: Pressure
ar: الضغط
de: Druck
es: Presión
ko: 압력

source: Privacy
ar: الخصوصية
de: Privatsphäre/DSGVO
es: Privacidad
ko: 비공개

source: Profile
ar: حساب تعريفي
de: Profil
es: Perfil
ko: 프로필

source: Profiles
ar: ملفات التعريف
de: Profile
es: Perfiles
ko: 프로필

source: Recipe
ar: وصفة
de: Rezept
es: Receta
ko: 레시피

source: Reconnect
ar: إعادة الاتصال
de: Verbinden
es: reconectar
ko: 다시 연결

source: Red
ar: أحمر
de: Rot
es: Rojo
ko: 빨간색

source: Save
ar: حفظ
de: Speichern
es: Ahorrar
ko: 저장

# screenBeanSelectAcidity
source: Acidity
ar: حموضة
de: Säure
es: Acidez
ko: 신맛

# screenBeanSelectAddressOfRoaster
source: Address
ar: عنوان
de: Addresse
es: DIRECCIÓN
ko: 주소

# screenBeanSelectDaysAgo
source: days ago
ar: منذ أيام
de: Tage her
es: hace días
ko: 며칠 전에

# screenBeanSelectDescriptionOfBean
source: Description
ar: وصف
de: Beschreibung
es: Descripción
ko: 설명

# screenBeanSelectDescriptionOfRoaster
source: Description
ar: وصف
de: Beschreibung
es: Descripción
ko: 설명

# screenBeanSelectHomepageOfRoaster
source: Homepage
ar: الصفحة الرئيسية
es: Página principal
ko: 홈페이지

# screenBeanSelectIntensity
source: Intensity
ar: مذاق القهوة
de: Intensität
es: Intensidad
ko: 강함

# screenBeanSelectNameOfBean
source: Name
ar: اسم
es: Nombre
ko: 이름

# screenBeanSelectNameOfRoaster
source: Name
ar: اسم
es: Nombre
ko: 이름

# screenBeanSelectRoastingDate
source: Roasting date
ar: تاريخ الحمص
de: Röst-Datum
es: Fecha de tueste
ko: 로스팅 날짜

# screenBeanSelectRoastLevel
source: Roast Level
ar: درجة حمص القهوة
de: Röstgrad
es: Nivel de tueste
ko: 로스트 레벨

# screenBeanSelectSelectBeans
source: Select Beans
ar: اختيار البُن
de: Wähle Bohne
es: Seleccione Frijoles
ko: 원두 선택

# screenBeanSelectSelectRoaster
source: Select Roaster
ar: اختيار الحمص
de: Wähle Röster
es: Seleccionar tostador
ko: 로스터 선택

# screenBeanSelectTasting
source: Tasting
ar: المذاق
de: Aromen
es: Saboreo
ko: 테스팅팅

# screenBeanSelectTitle
source: Beans and Roasters
ar: البُن والتحميص
de: Bohnen and Röster
es: Frijoles y Tostadores
ko: 원두와 로스터

# screenBeanSelectTypeOfBeans
source: Type of Beans
ar: نوع البُن
de: Typ der Bohne
es: Tipo de Frijoles
ko: 콩의 종류

# screenDiaryErrorUploadingShots
source: Error uploading shots
ar: خطأ في تحميل جرعات الاسبريسو
de: Fehler beim Hochladen
es: Error al subir tomas
ko: 샷 업로드 오류

# screenDiaryNoShotsToUploadSelected
source: No shots to upload selected
ar: لم يتم تحديد جرعات الاسبريسو للتحميل
de: Keine Shots zum hochladen ausgewählt
es: No hay tomas para subir seleccionadas
ko: 업로드할 사진이 선택되지 않았습니다.

# screenDiaryNothingSelected
source: Nothing selected
ar: لم تحدد شيء
de: Kein Shot ausgewählt
es: Nada seleccionado
ko: 선택된 항목 없음

# screenDiaryOverlaymode
source: Overlaymode:
ar: تغيير الرسم البياني
de: Overlaymodus:
es: Modo de superposición:
ko: 오버레이 모드:

# screenDiarySuccessUploadingYourShots
source: Success uploading your shots
ar: تم تحميل جرعات الاسبريسو الخاصة بك بنجاح
de: Hochladen war erfolgreich
es: Éxito subiendo tus fotos
ko: 샷 업로드 성공

# screenEspressoBean
source: Coffee
ar: قهوة
de: Bohnen
es: Café
ko: 커피

# screenEspressoDiary
source: Espresso Diary
ar: سجل الاسبريسو
de: Logbucheintrag
es: Diario de espresso
ko: 에스프레소 다이어리

# screenEspressoFlow
source: Flow
ar: التدفق
de: Fluss
es: Fluir
ko: 흐름

# screenEspressoFlowMlsPressureBar
source: Flow [ml/s] / Pressure [bar]
ar: التدفق [مل/ثانية] / الضغط [بار]
de: Fluss [ml/s] / Druck [bar]
es: Caudal [ml/s] / Presión [bar]
ko: 유량[ml/s] / 압력[bar]

# screenEspressoPour
source: Pour: {sec} s
ar: صب: {sec}
de: Bezug: {sec} s
es: Vierta: {sec} s
ko: 붓기: {sec}초

# screenEspressoPressure
source: Pressure
ar: الضغط
es: Presión
ko: 압력

# screenEspressoProfile
source: Profile
ar: ملف إعداد القهوة
de: Profil
es: Perfil
ko: 프로필

# screenEspressoRecipe
source: Recipe
ar: وصفة
de: Rezept
es: Receta
ko: 레시피

# screenEspressoRefillTheWaterTank
source: Refill the water tank
ar: أعد ملء خزان المياه
de: Bitte Wassertank füllen
es: Rellene el tanque de agua
ko: 물 탱크를 다시 채우십시오

# screenEspressoTarget
source: Target
ar: هدف
de: Ziel
es: Objetivo
ko: 표적

# screenEspressoTemp
source: Temp
ar: درجة الحرارة
es: Temperatura
ko: 온도

# screenEspressoTimer
source: Timer
ar: المؤقت
es: Temporizador
ko: 타이머

# screenEspressoTimes
source: Time/s
ar: الوقت / ثانية
de: Zeit/s
es: Veces
ko: 시간/s

# screenEspressoTotal
source: Total: {sec} s
ar: الإجمالي: {sec}
ko: 총 시간: {sec}초

# screenEspressoTtw
source: TTW: {sec} s
ko: TTW: {sec}초

# screenEspressoWeight
source: Weight
ar: الوزن
de: Gewicht
es: Peso
ko: 무게

# screenEspressoWeightG
source: Weight [g]
ar: الوزن (جرام)
de: Gewicht [g]
es: Peso (gramos]
ko: 무게 [g]

# screenRecipeAddRecipe
source: Add recipe
ar: أضف الوصفة
de: Rezept hinzufügen
es: Añadir receta
ko: 레시피 추가

# screenRecipeAdjustTempC
source: Adjust Temp [°C]
ar: ضبط درجة الحرارة [درجة مئوية]
de: Temp Anpassen [°C]
es: Ajustar temperatura [°C]
ko: 온도 조절 [°C]

# screenRecipeCoffeeNotes
source: Coffee notes
ar: إيحاءات القهوة
de: Bohnen Infos
es: notas de cafe
ko: 커피 노트

# screenRecipeEditAdjustments
source: Adjustments
ar: التعديلات
de: Anpassungen
es: Ajustes
ko: 조정

# screenRecipeEditDescription
source: Description
ar: وصف
de: Beschreibung
es: Descripción
ko: 설명

# screenRecipeEditDisableStoponweightSelectThisForPourOverWhereYouDo
source: Disable Stop-on-Weight (Select this for pour over where you do not want to stop on weight):
ar: قم بتعطيل Stop-on-Weight (حدد هذا للصب حيث لا تريد التوقف عن الوزن):
de: Stop-on-Weight deaktivieren (Wählen Sie dies für Profile, wo Sie nicht bei erreichen eines Gewichts stoppen möchten):
es: Deshabilite la parada por peso (seleccione esto para verter donde no desea detenerse por peso):
ko: Stop-on-Weight 비활성화

# screenRecipeEditDoseWeightin
source: Dose Weight-in
ar: الوزن بالجرعة
de: Bohnen Einwaage
es: Peso de la dosis
ko: 복용량 가중치

# screenRecipeEditDosingAndWeights
source: Dosing and weights
ar: الجرعات والأوزان
de: Verhältniss und Einwaagen
es: Dosificación y pesos
ko: 도징 및 무게

# screenRecipeEditGrinderModel
source: Model
ar: نموذج
es: Modelo
ko: 모델

# screenRecipeEditGrinderSettings
source: Grinder Settings
ar: إعدادات المطحنة
de: Mühle Einstellungen
es: Configuración del molinillo
ko: 그라인더 설정

# screenRecipeEditMilkAndWater
source: Milk and water
ar: الحليب والماء
de: Milch und Wasser
es: leche y agua
ko: 우유와 물

# screenRecipeEditMilkWeight
source: Milk weight
ar: وزن الحليب
de: Milch Einwaage
es: Peso de la leche
ko: 우유 무게

# screenRecipeEditNameOfRecipe
source: Name
ar: اسم
es: Nombre
ko: 이름

# screenRecipeEditRatio
source: Ratio
ar: نسبة
de: Verhältniss
es: Relación
ko: 비율

# screenRecipeEditRatioTo
source: to
ar: ل
de: zu
es: a
ko: 에게

# screenRecipeEditTemperatureCorrection
source: Temperature correction
ar: تصحيح درجة الحرارة
de: Temperatur Anpassungen
es: Corrección de temperatura
ko: 온도 보정

# screenRecipeEditTitle
source: Edit Recipe
ar: تحرير الوصفة
de: Rezept ändern
es: Editar receta
ko: 레시피 편집

# screenRecipeEditUseSteam
source: Use steam?
ar: استخدم البخار؟
de: Dampf?
es: ¿Usar vapor?
ko: 스팀을 사용합니까?

# screenRecipeEditUseWater
source: Use water?
ar: استخدم الماء؟
de: Wasser?
es: ¿Usar agua?
ko: 물을 사용합니까?

# screenRecipeEditWeightOut
source: Weight out
ar: خارج الوزن
de: Zielgewicht
es: Peso fuera
ko: 추출량

# screenRecipeGrindSettings
source: Grind Setting:
ar: إعدادات الطحن
de: Mühlen Einst.:
es: Ajustes de molienda:
ko: 분쇄 설정:

# screenRecipehotWater
source: Hot water:
ar: الماء الساخن
de: Heißwasser:
es: Agua caliente:
ko: 뜨거운 물:

# screenRecipeInitialTemp
source: Initial temperature:
ar: درجة الحرارة الأولية
de: Anfangs Temperatur:
es: Temperatura inicial:
ko: 초기 온도:

# screenRecipeProfileDetails
source: Profile Details
ar: تفاصيل الملف الشخصي
de: Profil Infos
es: detalles del perfil
ko: 프로필 세부정보

# screenRecipeRatio
source: Ratio:
ar: نسبة
de: Verhältniss:
es: Relación:
ko: 비율:

# screenRecipeRecipeDetails
source: Recipe Details
ar: تفاصيل الوصفة
de: Rezept Infos
es: Detalles de la receta
ko: 레시피 세부정보

# screenRecipeSelectedBean
source: Selected Bean
ar: حبوب البُن المحددة
de: Gewählte Bohnen
es: Frijol Seleccionado
ko: 선택한 원두

# screenRecipeSelectedProfile
source: Selected profile
ar: ملف إعداد القهوة المحدد
de: Gewähltes Profil
es: Perfil seleccionado
ko: 선택한 프로필

# screenRecipeSetRatio
source: Set Ratio
ar: تعيين النسبة
de: Verhältniss einstellen
es: Establecer proporción
ko: 비율 설정

# screenRecipesteamMilk
source: Steam milk:
ar: تبخير الحليب
de: Milch schäumen:
es: Leche al vapor:
ko: 스팀 밀크:

# screenRecipeStopOnWeight
source: Stop on weight:
ar: وقف الوزن:
de: Stop bei Gewicht: :
es: Parada de peso:
ko: 중량 중지:

# screenRecipeStopOnWeightG
source: Stop on Weight [g]
ar: وقف الوزن [جرام]
de: Stop bei Gewicht [g]
es: Parada en peso [g]
ko: 무게에 정지 [g]

# screenRecipeWeightinBeansG
source: Weight-in beans [g]
ar: حبوب البُن بالوزن [جم]
de: Einwaage Bohnen [g]
es: Peso en frijoles [g]
ko: 원두 무게 [g]

# screenRoasterEditAddress
source: Address
ar: عنوان
de: Adresse
es: DIRECCIÓN
ko: 주소

# screenRoasterEditDescription
source: Description
ar: وصف
de: Beschreibung
es: Descripción
ko: 설명

# screenRoasterEditHomepage
source: Homepage
ar: الصفحة الرئيسية
es: Página principal
ko: 홈페이지

# screenRoasterEditNameOfRoaster
source: Name
ar: اسم
es: Nombre
ko: 이름

# screenRoasterEditTitle
source: Edit Roaster
ar: تحرير المحمصة
de: Röster ändern
es: Editar tostador
ko: 로스터 편집

# screenSettingsApplicationSettings
source: Application Settings
ar: إعدادات التطبيق
de: Einstellungen
es: Configuraciones de la aplicación
ko: 애플리케이션 설정

# screenSettingsApplicationSettingsHardwareAndConnections
source: Hardware and connections
ar: الأجهزة والتوصيلات
de: Hardware and Verbindungen
es: Hardware y conexiones
ko: 하드웨어 및 연결

# screenSettingsApplicationSettingsScanForDevices
source: Scan for Devices
ar: البحث عن الأجهزة
de: Scanne nach Geräten
es: Buscar dispositivos
ko: 장치 검색

# screenSettingsApplicationSettingsScanStart
source: Scan for DE1 and scales (Lunar, Skale2, Eureka, Decent)
ar: البحث عن الديسنت والميزان (لونار، Skale2 ، يوريكا، ديسنت)
de: Scanne nach DE1 und Waagen (Lunar, Skale2, Eureka, Decent)
es: Busque DE1 y escalas (Lunar, Skale2, Eureka, Decent)
ko: DE1 및 저울 스캔(Lunar, Skale2, Eureka, Decent)

# screenSettingsArabic
source: Arabic
ar: عربي
de: Arabisch
es: Arábica
ko: 아라비아 말

# screenSettingsAutoTare
source: Auto Tare
ar: تصفير تلقائي للميزان
de: Auto Tara
es: Tara automática
ko: 자동 영점

# screenSettingsBackup
source: Backup
ar: دعم
es: Respaldo
ko: 백업업

# screenSettingsBackupAndMaintenance
source: Backup and maintenance
ar: النسخ الاحتياطي والصيانة
de: Backup und Wartung
es: Copia de seguridad y mantenimiento
ko: 백업 및 유지 관리

# screenSettingsBackuprestore
source: Backup/Restore
ar: اسنرجاع البيانات
es: Copia de seguridad de restauracion
ko: 백업/복원

# screenSettingsBackuprestoreDatabase
source: Backup/Restore database
ar: قاعدة بيانات النسخ الاحتياطي / الاستعادة
de: Backup/Restore Datenbank
es: Copia de seguridad/restauración de la base de datos
ko: 데이터베이스 백업/복원

# screenSettingsBackupSettings
source: Backup Settings
ar: إعدادات النسخ الاحتياطي
de: Backup Einstellungen
es: Configuración de copia de seguridad
ko: 백업 설정

# screenSettingsBahaviour
source: Behaviour
ar: البهائية
de: Verhalten
es: Comportamiento
ko: 행동

# screenSettingsBehaviour
source: Behaviour
ar: سلوك
de: Verhalten
es: Comportamiento
ko: 행동

# screenSettingsBrightnessSleepAndScreensaver
source: Brightness, sleep and screensaver
ar: السطوع والسكون وشاشة التوقف
de: Helligkeit, Ausschalten und Bildschirmschoner
es: Brillo, reposo y protector de pantalla
ko: 밝기, 절전 및 화면 보호기

# screenSettingsChangeHowTheAppIsChangingScreenBrightnessIfNot
source: Change how the app is changing screen brightness if not in use, switch the de1 on and shut it off if not used after a while.
ar: قم بتغيير كيفية تغيير التطبيق لسطوع الشاشة إذا لم تستخدم، قم بتشغيل الديسنت وأوقف تشغيلها إذا لم يتم استخدامها لفترة معينة.
de: Einstellen wie die App die Bildhelligkeit regelt wenn nich benutzt. Wie wird die de1 in den Standby geschaltet.
es: Cambie la forma en que la aplicación cambia el brillo de la pantalla si no está en uso, encienda el de1 y apáguelo si no lo usa después de un tiempo.
ko: 사용하지 않을 때 앱이 화면 밝기를 변경하는 방법을 변경하고 잠시 후 사용하지 않으면 de1을 켜고 종료합니다.

# screenSettingsChangeHowTheAppIsHandlingTheDe1InCase
source: Change how the app is handling the de1 in case of wake up and sleep.
ar: غيّر طريقة تعامل التطبيق مع de1 في حالة الاستيقاظ والنوم.
de: Ändern wie sich die App mit der de1 nach dem Standby und Start verhält.
es: Cambie la forma en que la aplicación maneja el de1 en caso de despertarse y dormir.
ko: 웨이크 업 및 슬립의 경우 앱이 de1을 처리하는 방법을 변경합니다.

# screenSettingsCheckYourRouterForIpAdressOfYourTabletOpen
source: Check your router for IP adress of your tablet. Open browser under
ar: تحقق من جهاز التوجيه الخاص بك لعنوان IP لجهازك اللوحي. افتح المتصفح تحت
de: Den Router für die IP Adresse des Tablets prüfen. Einen Browser öffnen unter
es: Verifique su enrutador para la dirección IP de su tableta. Abra el navegador debajo
ko: 라우터에서 태블릿의 IP 주소를 확인하십시오. 아래에서 브라우저 열기

# screenSettingsCloudAndNetwork
source: Cloud and Network
ar: السحابة والشبكة
de: Cloud und Netzwerk
es: Nube y red
ko: 클라우드 및 네트워크

# screenSettingsCloudShotUpload
source: Cloud shot upload
ar: تحميل سحابة بالرصاص
es: Carga de tomas en la nube
ko: 클라우드샷 업로드

# screenSettingsCoffeePouring
source: Coffee pouring
ar: صب القهوة
de: Espresso Bezug
es: Verter café
ko: 커피 푸어링

# screenSettingsCoffeeSection
source: Coffee
ar: قهوة
de: Kaffee
es: Café
ko: 커피

# screenSettingsDarkTheme
source: Dark theme
ar: مظهر داكن
de: Dunkles Theme
es: tema oscuro
ko: 어두운 테마

# screenSettingsDeleteAllScreensaverFiles
source: Delete all screensaver files
ar: احذف جميع ملفات شاشة التوقف
de: Alle Bildschirmhintergründe entfernen
es: Eliminar todos los archivos de salvapantallas
ko: 모든 화면 보호기 파일 삭제

# screenSettingsDoNotLetTabletGoToLockScreen0doNot
source: Do not let tablet go to lock screen (0=do not lock screen, 240=keep always locked) [min]
ar: لا تدع الجهاز اللوحي ينتقل إلى شاشة القفل (0 = لا تغلق الشاشة ، 240 = ابق مغلقًا دائمًا) [دقيقة]
de: Tablet nicht in den Sperrbildschirm gehen lassen (0=Sperrbildschirm erlauben, 240=Niemals Sperrbildschirm) [min]
es: No permita que la tableta vaya a la pantalla de bloqueo (0 = no bloquear la pantalla, 240 = mantener siempre bloqueado) [min]
ko: 태블릿을 잠금 화면으로 전환하지 않음(0=화면을 잠그지 않음, 240=항상 잠금 상태로 유지)[분]

# screenSettingsEnableMiniWebsiteWithPort8888
source: Enable Mini Website with port 8888
ar: قم بتمكين موقع الويب المصغر باستخدام المنفذ 8888
de: Mini Website aktivieren auf Port 8888
es: Habilitar mini sitio web con el puerto 8888
ko: 포트 8888로 미니 웹사이트 활성화

# screenSettingsEnableMqtt
source: Enable MQTT
ar: قم بتمكين MQTT
de: Aktiviere MQTT
es: Habilitar MQTT
ko: MQTT 활성화

# screenSettingsEnglish
source: English
ar: إنجليزي
de: Englisch
es: Inglés
ko: 영어

# screenSettingsExitApp
source: Exit app
ar: الخروج من التطبيق
de: App Beenden
es: Salir de la aplicación
ko: 앱 종료

# screenSettingsFailedRestoringBackup
source: Failed restoring backup
ar: فشل استعادة النسخة الاحتياطية
de: Wiederherstellung ist fehlgeschlagen.
es: Error al restaurar la copia de seguridad
ko: 백업 복원 실패

# screenSettingsFeedbackAndCrashReporting
source: Feedback and Crash reporting
ar: التعليقات وتقارير الأعطال
de: Feedback und Crash Berichte
es: Comentarios e informes de fallos
ko: 피드백 및 충돌 보고

# screenSettingsFlushTimerS
source: Flush timer [s]
ar: مؤقت التدفق
de: Spülen Timer [s]
es: Temporizador de descarga [s]
ko: 플러시 타이머 [s]

# screenSettingsGerman
source: German
ar: ألمانية
de: Deutsch
es: Alemán
ko: 독일어

# screenSettingsGoBackToRecipeScreenIfTimeoutOccured
source: Go back to Recipe screen if timeout occured
ar: ارجع إلى شاشة الوصفة إذا حدثت المهلة
de: Nach einem Timeout automatisch zum Rezept Bildschirm zurückwechseln
es: Volver a la pantalla Receta si se agotó el tiempo de espera
ko: 시간 초과가 발생한 경우 레시피 화면으로 돌아가기

# screenSettingsGraphDataDuringHeatingAndPreinfusionAreSavedIntoShot
source: Graph data during heating and preinfusion are saved into shot history.
ar: يتم حفظ بيانات الرسم البياني أثناء التسخين والتسريب المسبق في سجل اللقطات.
de: Speichere Diagramm Daten die während des Aufheizens und der Preinfusion gesammelt werden in die Shot Historie.
es: Los datos gráficos durante el calentamiento y la preinfusión se guardan en el historial de disparos.
ko: 가열 및 프리인퓨전 동안의 그래프 데이터는 샷 히스토리에 저장됩니다.

# screenSettingsHandlingOfConnectionsToOtherExternalSystemsLikeMqttAnd
source: Handling of connections to other external systems like MQTT and Visualizer.
ar: التعامل مع الاتصالات بأنظمة خارجية أخرى مثل MQTT و Visualizer.
de: Einstellungen für Verbindungen zu anderen Systemen wie MQTT und Visualizer.
es: Manejo de conexiones a otros sistemas externos como MQTT y Visualizer.
ko: MQTT 및 Visualizer와 같은 다른 외부 시스템에 대한 연결 처리.

# screenSettingsIfAShotIsStartingAutotareTheScale
source: If a shot is starting, auto-tare the scale
ar: تشغيل الميزان تلقائيا إذا بدأ الاستخلاص
de: Wenn ein Shot gestartet wird, wirt die Waage genullt.
es: Si está comenzando un disparo, tarar automáticamente la báscula
ko: 샷이 시작되면 자동 영점 조정

# screenSettingsifSwitchedOffYouDoNotSeeHeatingAndPreinfusion
source: If switched off you do not see heating and preinfusion in shot graph.
ar: إذا تم إيقاف التشغيل ، فلن ترى التسخين والتسريب المسبق في الرسم البياني للقطات.
de: Wenn deaktiviert, wird kein Aufheizen oder Preinfusion in den Diagrammen angezeigt.
es: Si está apagado, no verá el calentamiento ni la preinfusión en el gráfico de disparos.
ko: 스위치를 끄면 샷 그래프에 가열 및 프리인퓨전이 표시되지 않습니다.

# screenSettingsIfTheScaleIsConnectedItIsUsedToStop
source: If the scale is connected it is used to stop the shot if the profile has a limit given.
ar: إذا كان الميزان متصلًا، سيتم استخدامه لإيقاف الاستخلاص إذا كانت خطوات سيرالاستخلاص لها حد معين.
de: Wenn eine Waage erkannt wurde und im Rezept ein Zielgewicht angegeben wurde, wird der Shot angehalten - falls das Zielgewicht erreicht wurde
es: Si la báscula está conectada sirve para parar el tiro si el perfil tiene un límite dado.
ko: 저울이 연결된 경우 프로파일에 제한이 있는 경우 샷을 중지하는 데 사용됩니다.

# screenSettingsIfYouHaveNoGhcInstalledYouWouldNeedThe
source: If you have no GHC installed, you would need the flush screen
ar: إذا لم يكن لديك GHC مثبتًا ، فستحتاج إلى شاشة التدفق
de: Wenn kein GHC installiert ist wird der 'Spülen' Tab benötigt.
es: Si no tiene GHC instalado, necesitaría la pantalla de descarga
ko: GHC가 설치되어 있지 않으면 플러시 스크린이 필요합니다.

# screenSettingsKeepTabletChargedBetween6090
source: Keep Tablet charged between 60-90%
ar: احتفظ بالكمبيوتر اللوحي مشحونًا بنسبة تتراوح بين 60-90٪
de: Das Tablet immer geladen halten zwischen 60-90% (de1 USB Port)
es: Mantenga la tableta cargada entre 60-90%
ko: 태블릿을 60-90% 사이로 충전 상태 유지

# screenSettingsKorean
source: Korean
ar: الكورية
de: Koreanisch
es: coreano
ko: 한국어

# screenSettingsLanguage
source: Language
ar: لغة
de: Sprache
es: Idioma
ko: 언어

# screenSettingsLightTheme
source: Light theme
ar: مظهر فاتح
de: Helles Theme
es: Tema ligero
ko: 밝은 테마

# screenSettingsLoadScreensaverFiles
source: Load Screensaver files
ar: تحميل ملفات شاشة التوقف
de: Bildschirmhintergründe laden
es: Cargar archivos de salvapantallas
ko: 스크린세이버 파일 로드

# screenSettingsMessageQueueBroadcastMqttClient
source: Message Queue Broadcast (MQTT) client
ar: عميل بث قائمة انتظار الرسائل (MQTT)
es: Cliente de difusión de cola de mensajes (MQTT)
ko: MQTT(메시지 큐 브로드캐스트) 클라이언트

# screenSettingsMilkSteamingThermometerSupport
source: Milk steaming thermometer support
ar: دعم مقياس حرارة تبخير الحليب
de: Thermometer für Milch Aufschäumen
es: Soporte termometro vaporizador de leche
ko: 우유 스티밍 온도계 지원

# screenSettingsMiniWebsite
source: Mini Website
ar: موقع صغير
es: Minisitio web
ko: 미니 웹사이트

# screenSettingsMqttPassword
source: MQTT Password
ar: كلمة مرور MQTT
es: Contraseña MQTT
ko: MQTT 비밀번호

# screenSettingsMqttPort
source: MQTT Port
ar: ميناء MQTT
es: Puerto MQTT
ko: MQTT 포트

# screenSettingsMqttRootTopic
source: MQTT root topic
ar: موضوع الجذر MQTT
es: Tema raíz de MQTT
ko: MQTT 루트 주제

# screenSettingsMqttServer
source: MQTT Server
ar: خادم MQTT
es: Servidor MQTT
ko: MQTT 서버

# screenSettingsMqttUser
source: MQTT User
ar: مستخدم MQTT
es: Usuario MQTT
ko: MQTT 사용자

# screenSettingsPassword
source: password
ar: كلمة المرور
de: Passwort
es: contraseña
ko: 비밀번호

# screenSettingsPasswordCantBeSmallerThan7Letters
source: Password can't be smaller than 7 letters
ar: لا يمكن أن تكون كلمة المرور أصغر من 7 أحرف
de: Passwort muss mindestens 7 Zeichen lang sein
es: La contraseña no puede tener menos de 7 letras
ko: 비밀번호는 7글자보다 작을 수 없습니다.

# screenSettingsPowermode
source: Powermode
ar: وضع الطاقة
de: Power-Modus
es: Modo de energía
ko: 전원 모드

# screenSettingsPrivacySettings
source: Privacy Settings
ar: إعدادات الخصوصية
de: Privatsphäre und DSGVO
es: La configuración de privacidad
ko: 개인 정보 설정

# screenSettingsReduceBrightnessToLevel
source: Reduce brightness to level
ar: تقليل السطوع إلى المستوى
de: Helligkeit reduzieren
es: Reducir el brillo al nivel
ko: 밝기를 수준으로 낮추십시오.

# screenSettingsReduceScreenBrightnessAfter0offMin
source: Reduce screen brightness after (0=off) [min]
ar: تقليل سطوع الشاشة بعد (0 = إيقاف) [دقيقة]
de: Bildschirmhelligkeit reduzieren nach (0=aus) [min]
es: Reducir el brillo de la pantalla después de (0=apagado) [min]
ko: 이후 화면 밝기 감소(0=꺼짐)[분]

# screenSettingsRestore
source: Restore
ar: يعيد
es: Restaurar
ko: 복원

# screenSettingsRestoredBackup
source: Restored backup
ar: استعادة النسخ الاحتياطي
de: Backup wurde wiederhergestellt
es: Copia de seguridad restaurada
ko: 백업 복원

# screenSettingsSavedBackup
source: Saved backup
ar: نسخة احتياطية محفوظة
de: Die Sicherung wurde angelegt
es: Copia de seguridad guardada
ko: 저장된 백업
